package e02_list;

public class ListExample {
	/*
	 * 	List 특징
	 * 		1. 데이터 중복
	 * 		2. 리스트에 저장된 데이터 순서가 보장됨
	 * 	
	 * 	ArrayList : 리스트에서 데이터를 배열로 관리(순차리스트)
	 * 	LinkedList : 리스트에서 데이터를 노드 단위로 관리
	 * 	Vector : ArrayList와 동일, 동기화가 추가
	 * 
	 */
	public static void main(String[] args) {
		//문자열 저장하는 ArrayList 생성
		
		//데이터 추가 - 7건
		
		//데이터 삭제 - 인덱스 번호 2번에 해당하는 데이터 삭제
		
		//데이터 삭제 - 리스트에 저장된 값 기준으로 데이터 삭제
		
		//데이터에 저장된 데이터 개수
		
		//리스트에 저장된 특정 인덱스 데이터를 교체
		
		//리스트에 특정 인덱스 데이터를 저장
		
		//리스트에 특정 데이터가 있는지 확인
		
		//리스트에 특정 데이터가 몇번 인덱스에 있는지 확인
		
		//리스트에 있는 모든 데이터를 삭제
		
		//리스트에 데이터 없냐?
	}

}








